2.2.013/src/Catalogs/МК_НастройкиСвязиЗаявленийКЭДО/МК_НастройкиСвязиЗаявленийКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_НастройкиСвязиЗаявленийКЭДО</name>
  <attributes>
    <name>Опубликован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента1С</name>
    <type>
      <types>EnumRef.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтпуска</name>
    <type>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодШаблона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействияСЗаявлениями</name>
    <type>
      <types>EnumRef.МК_ДействияСЗаявлениями</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Enums/МК_ДействияСЗаявлениями/МК_ДействияСЗаявлениями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_ДействияСЗаявлениями</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Получать</name>
  </enumValues>
  <enumValues>
    <name>НеПолучать</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_НастройкиСвязиЗаявленийКЭДО/ManagerModule.bsl
// Метод получения списка шаблонов: GET /api/1c-exchange/edms/templates-list   

&НаСервере
Функция ПолучитьИОбработатьШаблоныИзМК()      Экспорт     
	мВозврат = 0;   // Возвращать будем кол-во добавленных элементов
	мСписок = ЗапросШаблоновИзМК();          // Возвращается массив структур: {ID, Name, Is_Show}
	мНашСписок = ПрочитатьИмеющийсяСписок(); // Возвращается массив структур: {Код, Наименование, Опубликован, Ссылка}     (Код - это поле МК_КодШаблона) 
	Для Каждого мЭлемент Из мСписок Цикл
		мИндекс = НайтиВМассиве(мНашСписок, мЭлемент.ID); 
		Если Не мИндекс = Неопределено Тогда  
			мОбъект = мНашСписок[мИндекс].Ссылка.ПолучитьОбъект();
			мОбъект.Наименование = мЭлемент.Name;
			мОбъект.Опубликован = мЭлемент.is_show;
			мНашСписок.Удалить(мИндекс);    
			мОбъект.Записать();
		Иначе    // Не нашли. Значит новый, надо добавить.
			мНовый = Справочники.МК_НастройкиСвязиЗаявленийКЭДО.СоздатьЭлемент();
			мНовый.МК_КодШаблона = мЭлемент.ID; 
			мНовый.ДействияСЗаявлениями = Перечисления.МК_ДействияСЗаявлениями.Новый;
			мНовый.Код = мЭлемент.ID;
			мНовый.Наименование = мЭлемент.Name;
			мНовый.Опубликован = мЭлемент.is_show;  
			мНовый.Записать(); 
			мВозврат = мВозврат + 1;
		КонецЕсли;  			
	КонецЦикла;	                           
	// Если в массиве мНашСписок что-нибудь осталось, то это - удаленные в МК шаблоны. Надо пометить их на удаление
	Для Каждого мЭлемент Из мНашСписок Цикл  
		мОбъект = Мэлемент.Ссылка.ПолучитьОбъект();
		мОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;	
	Возврат мВозврат;
КонецФункции

&НаСервере
Функция ЗапросШаблоновИзМК()                   
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мВозврат = Новый Массив; 
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/templates-list", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");	
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				мВозврат = СтрОтвет.Data.Templates;	
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения списка шаблонов. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
			Сообщить(мОшибка);
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

Функция ПрочитатьИмеющийсяСписок() 
	мВозврат = Новый Массив;
	мВыборка = Справочники.МК_НастройкиСвязиЗаявленийКЭДО.Выбрать();
	Пока мВыборка.Следующий() Цикл     
		Если мВыборка.ПометкаУдаления = Ложь Тогда      
			мСтруктура = Новый Структура("Код,Наименование,Опубликован,Ссылка", мВыборка.МК_КодШаблона, мВыборка.Наименование, мВыборка.Опубликован, мВыборка.Ссылка);
			мВозврат.Добавить(мСтруктура);
		КонецЕсли;
	КонецЦикла;
	Возврат(мВозврат);
КонецФункции

Функция НайтиВМассиве(мМассив, мКод)
	мВозврат = Неопределено; 
	мИндекс = 0;
	Для Каждого мЭлемент Из мМассив Цикл 
		Если мЭлемент.Код = мКод Тогда
			мВозврат = мИндекс;
			Прервать;
		КонецЕсли;  
		мИндекс = мИндекс + 1;
	КонецЦикла;  
	Возврат мВозврат;
КонецФункции 

&НаСервере
Функция НайтиШаблон(мКод)      Экспорт	
	мВозврат = Неопределено;
	мСсылка = НайтиПоРеквизиту("МК_КодШаблона",мКод);
	Если Не мСсылка.Пустая() Тогда
		мВозврат = мСсылка;  
	КонецЕсли;
	Возврат мВозврат;
КонецФункции
